system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: 空白模板                          |
|  \\    /   O peration     | 功能：控制计算时长、输出、求解器                |
|   \\  /    A nd           | Author: huangyi                               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// 头文件，固定
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// 用哪个求解器：simpleFoam = 稳态不可压流动
application     simpleFoam;

// 从 0 时刻开始
startFrom       startTime;
startTime       0;

// 算到 500 步停止
stopAt          endTime;
endTime         500;

// 时间步长（稳态简单流动设为1即可）
deltaT          1;

// 每100步输出一次结果
writeControl    timeStep;
writeInterval   100;

// 允许运行中修改文件
runTimeModifiable true;