system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | 长方体直管网格                                 |
|  \\    /   O peration     | 功能：生成一个最简单的 2D 管道                  |
|   \\  /    A nd           | 入口：左  出口：右  壁面：上下                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// 缩放比例：1=米，0.001=毫米
scale           1;

// 8个顶点，构成长方体
vertices
(
    (0 0 0)        // 0: 左下后
    (1 0 0)        // 1: 右下后
    (1 1 0)        // 2: 右上后
    (0 1 0)        // 3: 左上后
    (0 0 0.1)      // 4: 左下前
    (1 0 0.1)      // 5: 右下前
    (1 1 0.1)      // 6: 右上前
    (0 1 0.1)      // 7: 左上前
);

// 定义网格：六面体、网格数量、均匀分布
blocks
(
    hex (0 1 2 3 4 5 6 7)  // 用8个点围成六面体
    (20 5 1)               // X:20格, Y:5格, Z:1格（2D）
    simpleGrading (1 1 1)  // 网格均匀，不加密
);

// 边界名称（非常重要！必须和 U/p 文件对应）
boundary
(
    // 入口：左侧面
    inlet
    {
        type    patch;
        faces   ((0 3 7 4));
    }

    // 出口：右侧面
    outlet
    {
        type    patch;
        faces   ((1 2 6 5));
    }

    // 壁面：上下
    walls
    {
        type    wall;
        faces   ((0 1 5 4)(2 3 7 6));
    }

    // 前后：空边界（2D计算用）
    frontAndBack
    {
        type    empty;
        faces   ((0 1 2 3)(4 5 6 7));
    }
);