constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| 湍流模型                                                                    |
| laminar = 关闭湍流，最简单、最稳定、不报错                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;