constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| 流体属性文件                                                                |
| 作用：定义粘度、流体模型                                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// 牛顿流体（空气、水都是）
transportModel  Newtonian;

// 运动粘度 nu = 1e-5 m²/s（接近空气）
nu              nu [0 2 -1 0 0 0 0] 1e-05;